Repository: OpenDataNode/ckanext-odn-ic2pc-sync
Catalog: ckanext/i18n/*/LC_MESSAGES/ckanext_odn_ic2pc.po
Languages: sk

source: User {user} not authorized to edit {id}
sk: Používateľ {user} nie je oprávnený upravovať {id}

source: Dataset not found
sk: Dataset sa nepodarilo nájsť

source: Unauthorized to read package {id}
sk: Nie ste oprávnený čítať dataset {id}

source: Catalog deleted successfully.
sk: Katalóg bol úspešne odstránený.

source: Error: couldn't delete catalog, cause: {err_msg}
sk: Chyba: nepodarilo sa odstrániť katalóg, dôvod: {err_msg}

source: Could not connect to this catalog.
sk: Nepodarilo sa pripojit ku katalogu.

source: The verification was redirected to '{0}'. The synchronization may not function properly. Try to replace URL for the redirected url.
sk: Overovanie bolo presmerované na '{0}'. Synchronizácia nemusí fungovať správne. Skúste nahradiť URL za tú, na ktorú bola presmerovaná.

source: Organization with this id or name was not found.
sk: Nepodarilo sa nájsť organizáciu s týmto id alebo menom.

source: User with this API key is not authorized to edit datasets for organization {0}
sk: Používateľ s týmto API kľúčom nie je autorizovaný meniť dataset pre organizáciu {0}

source: This catalog requires authorization for organization {0}.
sk: Tento katalóg vyžaduje autorizáciu pre organizáciu {0}.

source: External catalog verification was successful.
sk: Kontrola externého katalógu bola úspešná.

source: Verify is not supported for type {0}
sk: Kontrola katalógu nie je podporovaná pre typ {0}

source: This field is required
sk: Tento údaj je povinný

source: This dataset already has external catalog with this URL
sk: Tento dataset už má pridaný externý katalóg s touto URL

source: Successfully created / edited catalog {url}
sk: Katalóg {url} bol úspešne vytvorený / upravený

source: Error: couldn't add catalog, cause: {err_msg}
sk: Chyba: nepodarilo sa pridať katalóg, dôvod: {err_msg}

source: Synchronization with public catalog ended.
sk: Synchronizácia s verejným katalógom bola ukončená.

source: Synchronization not started, the dataset isn't public.
sk: Synchronizácia nebola spustená, dataset nie je verejný.

source: Synchronization with external catalogs ended.
sk: Synchronizácia s externým katalógom bola ukončená.

source: Publishing
sk: Publikácia

source: Action
sk: Akcia

source: Add catalog
sk: Pridať katalóg

source: Synchronize with public catalog now
sk: Synchronizovať teraz s verejným katalógom

source: Synchronize with all external catalogs now
sk: Synchronizovať teraz so všetkými externými katalógmi

source: List of associated external catalogs
sk: Zoznam asociovaných externých katalógov

source: Type
sk: Typ

source: Authorization
sk: vyžaduje autorizáciu

source: Last sync on (UTC)
sk: Čas poslednej synchronizácie (UTC)

source: Status
sk: Stav

source: Yes
sk: Áno

source: No
sk: Nie

source: Edit
sk: Upraviť

source: Delete
sk: Zmazať

source: Synchronize now
sk: Synchronizovať teraz

source: no external catalogs defined
sk: Nie je špecifikovný žiadny externý katalóg

source: Deleting catalog
sk: Zmazanie katalógu

source: Deletion of external catalog
sk: Zmazanie externého katalógu

source: Type of catalog:
sk: Typ katalógu:

source: URL of external catalog:
sk: URL externého katalógu:

source: Delete this catalog?
sk: Zmazať tento katalóg?

source: Back
sk: Naspäť

source: Edit catalog
sk: Upraviť katalóg

source: Modify external catalog
sk: Upravenie externého katalógu

source: Add new external catalog
sk: Pridanie nového katalógu

source: Type of catalog
sk: Typ katalógu

source: URL of external catalog
sk: URL externého katalógu

source: http://...
sk: http://demo.ckan.org

source: Requires authorization
sk: Vyžaduje autorizáciu

source: Authorization (API key)
sk: Autorizácia (API kľúč)

source: API key
sk: API kľúč

source: Organization
sk: Organizácia

source: organization id or name
sk: id alebo meno organizácie

source: If checked, the newly created dataset will be marked as private. When updating already existing dataset, the state doesn't change.
sk: Ak je zaškrtnuté, novo vytvrený dataset bude označený ako privátny. Ak sa updatuje už existujúci dataset, stav ostáva nezmenený.

source: Initially create as private
sk: Spočiatku vytvoriť ako súkromný

source: Verify
sk: Overiť

source: Save
sk: Uložiť
